---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizes.Contains(System.Double)
source: html/5e387d9d-c99a-ac14-30d5-8918a1772585.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizes.Contains Method

Checks whether a duct size with the nominal diameter exists.

## Syntax (C#)
```csharp
public bool Contains(
	double nominalDiameter
)
```

## Parameters
- **nominalDiameter** (`System.Double`) - Nominal diameter.

## Returns
True if a duct size with the nominal diameter exists.